In [1]:
import pandas as pd

In [9]:
#2 main datatypes
series=pd.Series(["BMW","Toyoyta","honda","tesla"])

In [10]:
series

0        BMW
1    Toyoyta
2      honda
3      tesla
dtype: object

In [11]:
#series =1-dimensional

In [12]:
colours=pd.Series(["Red","Blue","White","Green"])
colours

0      Red
1     Blue
2    White
3    Green
dtype: object

In [13]:
#Dataframe =2 Dimensional

In [14]:
car_data=pd.DataFrame({"Car make":series,"Colors":colours})

In [15]:
car_data

  Car make Colors
0      BMW    Red
1  Toyoyta   Blue
2    honda  White
3    tesla  Green

In [16]:
#import data
car_sales=pd.read_csv("car-sales.csv")

In [17]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [18]:
#Exporting the DataFrame
car_sales.to_csv("exported-car-sales.csv")

In [ ]:
exported_car_sales=pd.read_csv("exported-car-sales.csv")
exported_car_sales